# **Python Packages**
- pymySQL: Allows access to the MySQL database server from Python
- ipython-SQL: The ipython-sql package allows you to write SQL queries into code cells using magic commands.

# **Magic commands**
- % Inline
- %% Multiple Lines

In [1]:
%%capture
!pip install ipython-sql 
!pip install pymysql 
!pip install ipython-sql==0.4.1 
!pip install prettytable==0.7.2 
!pip install SQLAlchemy==1.4.49 
!pip install cryptography 
!pip install PyMySQL[rsa]

In [2]:
#prepare SQL environment
%load_ext sql

In [3]:
import urllib.parse

raw_password = "password-y/@N"

USERNAME = "root"  
PASSWORD = urllib.parse.quote_plus(raw_password)
HOST = "localhost"
PORT = 3306
DATABASE = "united_nations"

connection_string = f"mysql+pymysql://{USERNAME}:{PASSWORD}@{HOST}:{PORT}/{DATABASE}"
%sql $connection_string

### 1. Display database

In [4]:
%%sql

SELECT * 
FROM 
    united_nations.access_to_basic_services 
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2015, Decimal('94.67'), Decimal('98.00'), Decimal('17.542806'), Decimal('184.39'), Decimal('2699700.00'), Decimal('4.93')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2016, Decimal('94.67'), Decimal('98.00'), Decimal('17.794055'), Decimal('137.28'), Decimal('2699700.00'), Decimal('4.96')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2017, Decimal('95.00'), Decimal('98.00'), Decimal('18.037776'), Decimal('166.81'), Decimal('2699700.00'), Decimal('4.90')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2018, Decimal('95.00'), Decimal('98.00'), Decimal('18.276452'), Decimal('179.34'), Decimal('2699700.00'), Decimal('4.85')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2019, Decimal('95.00'), Decimal('98.00'), Decimal('18.513673'), Decimal('181.67'), Decimal('2699700.00'), Decimal('4.80')),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2020, Decimal('95.00'), Decimal('98.00'), Decimal('18.755666'), Decimal('171.08'), Decimal('2699700.00'), Decimal('4.89')),
 ('Central and Southern Asia', 'Central Asia', 'Kyrgyzstan', 2015, Decimal('89.67'), Decimal('96.67'), None, None, None, None),
 ('Central and Southern Asia', 'Central Asia', 'Kyrgyzstan', 2016, Decimal('90.33'), Decimal('96.67'), None, None, None, None),
 ('Central and Southern Asia', 'Central Asia', 'Kyrgyzstan', 2017, Decimal('91.00'), Decimal('97.33'), None, None, None, None),
 ('Central and Southern Asia', 'Central Asia', 'Kyrgyzstan', 2018, Decimal('91.33'), Decimal('97.33'), None, None, None, None)]

### 2. Unique country names
Get the unique countries from the DB

In [5]:
%%sql

SELECT DISTINCT
    Country_name
FROM 
    united_nations.access_to_basic_services
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Kazakhstan',),
 ('Kyrgyzstan',),
 ('Tajikistan',),
 ('Turkmenistan',),
 ('Uzbekistan',),
 ('Afghanistan',),
 ('Bangladesh',),
 ('Bhutan',),
 ('India',),
 ('Iran (Islamic Republic of)',)]

**Create a new table called Country_list save the unique country names into this table.**

In [6]:
%%sql

DROP TABLE Country_list;
CREATE TABLE Country_list(Country VARCHAR(255));
INSERT INTO Country_list(Country)
SELECT DISTINCT
    Country_name
FROM 
    united_nations.access_to_basic_services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
0 rows affected.
0 rows affected.
182 rows affected.

[]

### 3. Selecting specific fields
Select the country_name, time_period, pct_managed_drinking_water in your query results.

In [7]:
%%sql

SELECT 
    Country_name,
    Time_period,
    Pct_managed_drinking_water_services 
FROM 
    access_to_basic_services
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Kazakhstan', 2015, Decimal('94.67')),
 ('Kazakhstan', 2016, Decimal('94.67')),
 ('Kazakhstan', 2017, Decimal('95.00')),
 ('Kazakhstan', 2018, Decimal('95.00')),
 ('Kazakhstan', 2019, Decimal('95.00')),
 ('Kazakhstan', 2020, Decimal('95.00')),
 ('Kyrgyzstan', 2015, Decimal('89.67')),
 ('Kyrgyzstan', 2016, Decimal('90.33')),
 ('Kyrgyzstan', 2017, Decimal('91.00')),
 ('Kyrgyzstan', 2018, Decimal('91.33'))]

**Rename Pct_managed_drinking_water_services to Pct_access_to_water**

In [8]:
%%sql

SELECT 
    Country_name,
    Time_period,
    Pct_managed_drinking_water_services 
AS
    Pct_access_to_water
FROM 
    access_to_basic_services
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Kazakhstan', 2015, Decimal('94.67')),
 ('Kazakhstan', 2016, Decimal('94.67')),
 ('Kazakhstan', 2017, Decimal('95.00')),
 ('Kazakhstan', 2018, Decimal('95.00')),
 ('Kazakhstan', 2019, Decimal('95.00')),
 ('Kazakhstan', 2020, Decimal('95.00')),
 ('Kyrgyzstan', 2015, Decimal('89.67')),
 ('Kyrgyzstan', 2016, Decimal('90.33')),
 ('Kyrgyzstan', 2017, Decimal('91.00')),
 ('Kyrgyzstan', 2018, Decimal('91.33'))]

### 4. Filtering and sorting data
Modify your query to only display data for the year 2020.

In [9]:
%%sql

SELECT 
    Country_name,
    Time_period,
    Pct_managed_drinking_water_services 
AS
    Pct_access_to_water
FROM 
    access_to_basic_services
WHERE
    Time_period = 2020
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Kazakhstan', 2020, Decimal('95.00')),
 ('Kyrgyzstan', 2020, Decimal('92.67')),
 ('Tajikistan', 2020, Decimal('85.00')),
 ('Turkmenistan', 2020, Decimal('100.00')),
 ('Uzbekistan', 2020, Decimal('98.00')),
 ('Afghanistan', 2020, Decimal('80.33')),
 ('Bangladesh', 2020, Decimal('97.67')),
 ('Bhutan', 2020, Decimal('97.33')),
 ('India', 2020, Decimal('91.00')),
 ('Iran (Islamic Republic of)', 2020, Decimal('96.67'))]

**Sort the data**

In [10]:
%%sql

SELECT 
    Country_name,
    Time_period,
    Pct_managed_drinking_water_services 
AS
    Pct_access_to_water
FROM 
    access_to_basic_services
WHERE
    Time_period = 2020
ORDER BY 
    Pct_access_to_water
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Central African Republic', 2020, Decimal('38.33')),
 ('Democratic Republic of the Congo', 2020, Decimal('47.67')),
 ('South Sudan', 2020, Decimal('48.33')),
 ('Angola', 2020, Decimal('52.33')),
 ('Chad', 2020, Decimal('52.67')),
 ('Burkina Faso', 2020, Decimal('53.33')),
 ('Madagascar', 2020, Decimal('56.33')),
 ('Papua New Guinea', 2020, Decimal('56.67')),
 ('Somalia', 2020, Decimal('57.33')),
 ('Niger', 2020, Decimal('57.33'))]

In [11]:
%reload_ext sql

In [12]:
%sql sqlite:///chinook.db

In [13]:
%%sql
SELECT 
    FirstName,
    LastName,
    HireDate
FROM 
    employees;

   mysql+pymysql://root:***@localhost:3306/united_nations
 * sqlite:///chinook.db
Done.

[('Andrew', 'Adams', '2002-08-14 00:00:00'),
 ('Nancy', 'Edwards', '2002-05-01 00:00:00'),
 ('Jane', 'Peacock', '2002-04-01 00:00:00'),
 ('Margaret', 'Park', '2003-05-03 00:00:00'),
 ('Steve', 'Johnson', '2003-10-17 00:00:00'),
 ('Michael', 'Mitchell', '2003-10-17 00:00:00'),
 ('Robert', 'King', '2004-01-02 00:00:00'),
 ('Laura', 'Callahan', '2004-03-04 00:00:00')]